DataProcessors/ДублиНСИ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>ДублиНСИ</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/ДублиНСИКПодтверждению.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ДублиНСИКПодтверждению</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Источник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПравилаПоискаДублейНСИ</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаДобавления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоМестИспользования</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПоискаМестИспользования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТипСсылки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ГруппаДублей</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Дубль</Name>
					<Type>
						<v8:TypeSet>cfg:ChartOfCharacteristicTypesRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ДублиНСИ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ДублиНСИ</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Оригинал</Name>
					<Type>
						<v8:TypeSet>cfg:ChartOfCharacteristicTypesRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаДобавления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоМестИспользования</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПоискаМестИспользования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СостояниеУдаленияДубля</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияУдаленияДублейНСИ</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОшибкиЗамены</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоПопытокЗамены</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТипСсылки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Дубль</Name>
					<Type>
						<v8:TypeSet>cfg:ChartOfCharacteristicTypesRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/СостоянияУдаленияДублейНСИ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СостоянияУдаленияДублейНСИ</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>УдалениеНеПланируется</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗапланированаЗаменаСсылокИУдаление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаменаСсылокИУдалениеПриостановленыИзЗаОшибок</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ПравилаПоискаДублейНСИ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ПравилаПоискаДублейНСИ</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ОбъектМетаданных</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Активно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Изменено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Запрос</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Переопределяемое</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

DataProcessors/ДублиНСИ/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

#Область Отчет

// Формирует и возвращает отчет для сравнения данных найденных дублей НСИ.
//
// Параметры:
//   ИдентификаторДублей - см.Обработка.ДублиНСИ.Форма.СравнениеИПодтверждениеДублей.ИдентификаторДублей
//   Дубли - см.Обработка.ДублиНСИ.Форма.СравнениеИПодтверждениеДублей.Дубли
//   ВариантСравнения - см.Обработка.ДублиНСИ.Форма.СравнениеИПодтверждениеДублей.ВариантСравненияДублей
//
// Возвращаемое значение:
//   ТабличныйДокумент - Отчет с данными для сравнения дублей.
//
Функция ОтчетОСравнении(ИдентификаторДублей, Дубли, ВариантСравнения) Экспорт
	
	ПолноеИмяТаблицыСравнения = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ИдентификаторДублей, "ПолноеИмя");
	ЧастиИмени = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ПолноеИмяТаблицыСравнения, ".");
	
	КлассОбъектаМетаданных = ЧастиИмени[0];
	ИмяОбъектаМетаданных = ЧастиИмени[1];
	
	Если ВРег(КлассОбъектаМетаданных) = "СПРАВОЧНИК" Тогда
		ОбъектМетаданных = Метаданные.Справочники[ИмяОбъектаМетаданных];
	ИначеЕсли ВРег(КлассОбъектаМетаданных) = "ПЛАНВИДОВХАРАКТЕРИСТИК" Тогда
		ОбъектМетаданных =  Метаданные.ПланыВидовХарактеристик[ИмяОбъектаМетаданных];
	Иначе
		Возврат Новый ТабличныйДокумент();
	КонецЕсли;
	
	Боковик = Новый СписокЗначений;
	ИменаСинонимы = Новый Соответствие;
	
	ДополнительныеРеквизиты = ДополнительныеРеквизиты();
	ПоискИЗаменаДублейНСИПереопределяемый.ПриОпределенииДополнительныхРеквизитов(ДополнительныеРеквизиты);
	
	КонтекстФормированияОтчета = Новый Структура;
	КонтекстФормированияОтчета.Вставить("Индексы", ИндексыДляПостроенияОтчета());
	КонтекстФормированияОтчета.Вставить("Боковик", Боковик);
	КонтекстФормированияОтчета.Вставить("ИменаСинонимы", ИменаСинонимы);
	КонтекстФормированияОтчета.Вставить("ДополнительныеРеквизиты", ПреобразоватьТаблицуВСоответствие(ДополнительныеРеквизиты));
	
	РеквизитыВОтчет = КонтекстФормированияОтчета.Индексы.РеквизитыВОтчет;
	ТабличныеЧастиВОтчет = КонтекстФормированияОтчета.Индексы.ТабличныеЧастиВОтчет;
	ВсеРеквизитыИЗначения = КонтекстФормированияОтчета.Индексы.ВсеРеквизитыИЗначения;
	
	//Основная таблица
	РеквизитыПоляЗапроса = РеквизитыПоляЗапроса(ОбъектМетаданных, КонтекстФормированияОтчета);
	ИсключитьСлужебныеРеквизиты(РеквизитыПоляЗапроса, ОбъектМетаданных, КонтекстФормированияОтчета);
	
	ПоднятьРеквизитыВНачалоСписка(Боковик);
	
	Запрос = Новый Запрос; 
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	&ПоляЗапроса
	|ИЗ
	|	&ПолноеИмяТаблицы КАК Т
	|ГДЕ
	|	Т.Ссылка В(&ОтборПоСсылкам)";
	
	ПоляЗапроса = СтрСоединить(РеквизитыПоляЗапроса, "," + Символы.ПС + Символы.Таб);
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПоляЗапроса", ПоляЗапроса);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПолноеИмяТаблицы", ПолноеИмяТаблицыСравнения);
	Запрос.Текст = ТекстЗапроса;
	ДублиОтсортированные = ДублиОтсортированные(Дубли);
	Запрос.УстановитьПараметр("ОтборПоСсылкам", ДублиОтсортированные.ВыгрузитьКолонку("Дубль"));
	
	РезультатЗапроса = Запрос.Выполнить();
	ДополнитьКонтекстПоОсновнойТаблице(КонтекстФормированияОтчета, РезультатЗапроса, ОбъектМетаданных);
	
	//Связанная таблица
	СвязанныеОбъекты = ПоискИЗаменаДублейНСИ.СвязанныеОбъекты();
	ПоискИЗаменаДублейНСИПереопределяемый.ПриОпределенииСвязанныхОбъектов(СвязанныеОбъекты);
	СвязиОбъектов = ПоискИЗаменаДублейНСИ.СвязиОбъектов();
	
	Для Каждого СтрокаСвязи Из СвязанныеОбъекты Цикл
		ДобавитьСвязьОбъектов(СвязиОбъектов, СтрокаСвязи);
	КонецЦикла;
	
	ТипРеквизитаСвязи = ТипЗнч(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ИдентификаторДублей, "ЗначениеПустойСсылки"));
	ИспользуемыеСвязи = СвязиОбъектов.НайтиСтроки(Новый Структура("ТипРеквизита", ТипРеквизитаСвязи));
	
	Если ИспользуемыеСвязи.Количество() > 1 Тогда
		ТекстОшибки = НСтр("ru = 'Невозможно сформировать отчет о сравнении. Обратитесь к администратору.'");
		ИмяМетода = "ПоискИЗаменаДублейНСИПереопределяемый.ПриОпределенииСвязанныхОбъектов"; 
		ДляАдминистратора = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Ошибка в указании связей: для связи подчиненного справочника указано несколько реквизитов. Проверьте корректность заполнения связей в методе %1.'"),
				ИмяМетода);
		ВызватьИсключение(ТекстОшибки, , , ДляАдминистратора);
	КонецЕсли;
	
	Если ИспользуемыеСвязи.Количество() Тогда
		
		ПолноеИмяДополнительнойТаблицы = ИспользуемыеСвязи[0].Ключ;
		ПолеСвязи = ИспользуемыеСвязи[0].ИмяРеквизита;
		ОбъектМетаданных = ИспользуемыеСвязи[0].Метаданные;
		
		РеквизитыПоляЗапросаСвязанного = РеквизитыПоляЗапроса(ОбъектМетаданных, КонтекстФормированияОтчета);
		ИсключитьСлужебныеРеквизиты(РеквизитыПоляЗапросаСвязанного, ОбъектМетаданных, КонтекстФормированияОтчета);
		
		Запрос = Новый Запрос; 
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	&ПоляЗапросаДополнительнойТаблицы
		|ИЗ
		|	&ПолноеИмяДополнительнойТаблицы КАК Т
		|ГДЕ
		|	&ПолеСвязи В(&ОтборПоПолюСвязи)
		|ИТОГИ ПО
		|	&ПолеСвязиИтог";
		
		ПоляЗапроса = СтрСоединить(РеквизитыПоляЗапросаСвязанного, "," + Символы.ПС + Символы.Таб);
		
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПоляЗапросаДополнительнойТаблицы", ПоляЗапроса);
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПолноеИмяДополнительнойТаблицы", ПолноеИмяДополнительнойТаблицы);
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПолеСвязиИтог", ПолеСвязи);
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПолеСвязи", "Т." + ПолеСвязи);
		Запрос.Текст = ТекстЗапроса;
		Запрос.УстановитьПараметр("ОтборПоПолюСвязи", ДублиОтсортированные);
		
		РезультатЗапроса = Запрос.Выполнить();
		ДополнитьКонтекстПоСвязаннойТаблице(КонтекстФормированияОтчета, РезультатЗапроса, ОбъектМетаданных, ПолеСвязи);
		
	КонецЕсли;
	
	//Отметка повторяющихся реквизитов
	Боковик.ЗаполнитьПометки(Истина);
	ВсегоДублей = ДублиОтсортированные.Количество();
	Для Каждого ЭлементСписка Из Боковик Цикл
		ИмяРеквизита = ЭлементСписка.Значение;
		
		Повторы = ВсеРеквизитыИЗначения[ИмяРеквизита];
		Если Повторы = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Для Каждого Повтор Из Повторы Цикл
			
			ПовторяемоеЗначение = Повтор.Ключ;
			КоличествоПовторов = Повтор.Значение;
			
			Для Каждого РеквизитВОтчет Из РеквизитыВОтчет Цикл
				Если РеквизитВОтчет.Значение[ИмяРеквизита] <> Неопределено
					И РеквизитВОтчет.Значение[ИмяРеквизита].ЗначениеРеквизита = ПовторяемоеЗначение Тогда
						
					РеквизитВОтчет.Значение[ИмяРеквизита].ЗначениеПовторяется = (КоличествоПовторов > 1);
				КонецЕсли;
			КонецЦикла;
			
			Если КоличествоПовторов = ВсегоДублей Тогда
				ЭлементСписка.Пометка = Ложь;
			КонецЕсли;
			
		КонецЦикла;
	КонецЦикла;
	
	ДанныеФормированияОтчета = Новый Структура;
	ДанныеФормированияОтчета.Вставить("Боковик", ПодготовитьБоковик(Боковик, ВариантСравнения));
	ДанныеФормированияОтчета.Вставить("ИменаСинонимы", ИменаСинонимы);
	ДанныеФормированияОтчета.Вставить("РеквизитыВОтчет", РеквизитыВОтчет);
	ДанныеФормированияОтчета.Вставить("ТабличныеЧастиВОтчет", ТабличныеЧастиВОтчет);
	ДанныеФормированияОтчета.Вставить("ДублиОтсортированные", ДублиОтсортированные);
	
	Возврат ПодготовитьОтчет(ДанныеФормированияОтчета);
	
КонецФункции

// Создает и возвращает структуру с вспомогательными индексами для обработки данных и построения отчета.
// РеквизитыВОтчет индекс построен по "Дубль, Имя реквизита" содержит значение реквизита и признак повтора значения.
// ТабличныеЧастиВОтчет индекс построен по "Имя табличной части, Дубль", содержит табличную часть дубля.
// ВсеРеквизитыИЗначения индекс построен по "Имя реквизита, Значение реквизита", содержит количество повторов значений.
// В возвращаемом значении описана итоговая структура наполнения индексов.
//
// Возвращаемое значение:
//   Структура:
//      *РеквизитыВОтчет - Соответствие из КлючИЗначение:
//         **Ключ - ЛюбаяСсылка - ссылка на дубль.
//         **Значение - Соответствие из КлючИЗначение:
//            ***Ключ - Строка - имя реквизита.
//            ***Значение - Структура из КлючИЗначение:
//               ****ЗначениеРеквизита - Неопределено - значение реквизита.
//               ****ЗначениеПовторяется - Булево - признак повтора значения реквизита среди дублей.
//
//      *ТабличныеЧастиВОтчет - Соответствие из КлючИЗначение:
//         **Ключ - Строка - имя табличной части.
//         **Значение - Соответствие из КлючИЗначение:
//            ***Ключ - ЛюбаяСсылка - ссылка на дубль.
//            ***Значение - ТаблицаЗначений - табличная часть.
//   
//      *ВсеРеквизитыИЗначения - Соответствие из КлючИЗначение:
//         **Ключ - Строка - имя реквизита.
//         **Значение - Соответствие из КлючИЗначение:
//            ***Ключ - Неопределено - значение реквизита.
//            ***Значение - Число - количество повторов значения реквизита среди дублей.
//
Функция ИндексыДляПостроенияОтчета()
	
	РеквизитыВОтчет = Новый Соответствие;
	ТабличныеЧастиВОтчет = Новый Соответствие;
	ВсеРеквизитыИЗначения = Новый Соответствие;
	
	Индексы = Новый Структура;
	Индексы.Вставить("РеквизитыВОтчет", РеквизитыВОтчет);
	Индексы.Вставить("ТабличныеЧастиВОтчет", ТабличныеЧастиВОтчет);
	Индексы.Вставить("ВсеРеквизитыИЗначения", ВсеРеквизитыИЗначения);
	
	Возврат Индексы;
	
КонецФункции

// Возвращает таблицу для описания расположения дополнительных реквизитов, которые хранятся в табличных частях.
//
// Возвращаемое значение:
//   ТаблицаЗначений:
//      *ИмяТабличнойЧасти - Строка - имя табличной части, которая описывается как реквизит.
//      *КолонкаРеквизита - Строка - имя колонки в табличной части, содержащей имя реквизита.
//      *КолонкаЗначения - Строка - имя колонки в табличной части, содержащей значение реквизита.
//
Функция ДополнительныеРеквизиты()
	
	ТипСтрока = ОбщегоНазначения.ОписаниеТипаСтрока(150);
	
	Результат = Новый ТаблицаЗначений;
	Результат.Колонки.Добавить("ИмяТабличнойЧасти", ТипСтрока);
	Результат.Колонки.Добавить("КолонкаРеквизита", ТипСтрока);
	Результат.Колонки.Добавить("КолонкаЗначения", ТипСтрока);
	
	Возврат Результат;
	
КонецФункции
	
// Параметры:
//   ДополнительныеРеквизиты - см.ДополнительныеРеквизиты
//
// Возвращаемое значение:
//   Соответствие из КлючИЗначение
//
Функция ПреобразоватьТаблицуВСоответствие(ДополнительныеРеквизиты)
	
	Результат = Новый Соответствие;
	
	ДополнительныеРеквизиты.Сортировать("ИмяТабличнойЧасти");
	Для Каждого Строка Из ДополнительныеРеквизиты Цикл
		
		ИмяТабличнойЧасти = Строка.ИмяТабличнойЧасти;
		КолонкаРеквизита = Строка.КолонкаРеквизита;
		КолонкаЗначения = Строка.КолонкаЗначения;
		
		Если Не ЗначениеЗаполнено(ИмяТабличнойЧасти)
			Или Не ЗначениеЗаполнено(КолонкаРеквизита)
			Или Не ЗначениеЗаполнено(КолонкаЗначения) Тогда
			Продолжить;
		КонецЕсли;
		
		Результат.Вставить(ИмяТабличнойЧасти,
			Новый Структура("ИмяРеквизита,ЗначениеРеквизита", КолонкаРеквизита, КолонкаЗначения));
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция РеквизитыПоляЗапроса(ОбъектМетаданных, КонтекстФормированияОтчета)
	
	Результат = Новый Массив;
	
	Боковик = КонтекстФормированияОтчета.Боковик;
	ИменаСинонимы = КонтекстФормированияОтчета.ИменаСинонимы;
	ТабличныеЧастиВОтчет = КонтекстФормированияОтчета.Индексы.ТабличныеЧастиВОтчет;
	ВсеРеквизитыИЗначения = КонтекстФормированияОтчета.Индексы.ВсеРеквизитыИЗначения;
	ДополнительныеРеквизиты = КонтекстФормированияОтчета.ДополнительныеРеквизиты;
	
	Для Каждого Реквизит Из ОбъектМетаданных.СтандартныеРеквизиты Цикл
		Результат.Добавить(Реквизит.Имя);
		ИменаСинонимы.Вставить(Реквизит.Имя,
			?(ЗначениеЗаполнено(Реквизит.Синоним), Реквизит.Синоним, Реквизит.Имя));
	КонецЦикла;
	
	Для Каждого Реквизит Из ОбъектМетаданных.Реквизиты Цикл
		Результат.Добавить(Реквизит.Имя);
		ИменаСинонимы.Вставить(Реквизит.Имя,
			?(ЗначениеЗаполнено(Реквизит.Синоним), Реквизит.Синоним, Реквизит.Имя));
	КонецЦикла;
	
	Для Каждого Реквизит Из Результат Цикл
		Боковик.Добавить(Реквизит);
	КонецЦикла;
	
	Для Каждого ТабличнаяЧасть Из ОбъектМетаданных.ТабличныеЧасти Цикл
		Результат.Добавить(ТабличнаяЧасть.Имя);
		
		Если ДополнительныеРеквизиты[ТабличнаяЧасть.Имя] = Неопределено Тогда
			ТабличныеЧастиВОтчет.Вставить(ТабличнаяЧасть.Имя, ЗначениеПустая());
			ИменаСинонимы.Вставить(ТабличнаяЧасть.Имя, ТабличнаяЧасть.Синоним);
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого ИмяРеквизита Из Результат Цикл
		ВсеРеквизитыИЗначения.Вставить(ИмяРеквизита, Новый Соответствие);
	КонецЦикла;
		
	Возврат Результат;
	
КонецФункции

Процедура ИсключитьСлужебныеРеквизиты(РеквизитыПоляЗапроса, ОбъектМетаданных, КонтекстФормированияОтчета)
	
	ИсключенияРеквизитов = ИсключенияРеквизитов(ОбъектМетаданных); 
	Боковик = КонтекстФормированияОтчета.Боковик;
	ИменаСинонимы = КонтекстФормированияОтчета.ИменаСинонимы;
	
	Для Каждого Элемент Из ИсключенияРеквизитов Цикл
		Кандидат = РеквизитыПоляЗапроса.Найти(Элемент);
		
		Если Кандидат <> Неопределено Тогда
			РеквизитыПоляЗапроса.Удалить(Кандидат);
			
			Индекс = Боковик.НайтиПоЗначению(ИменаСинонимы[Элемент]);
			Если Индекс <> Неопределено Тогда
				Боковик.Удалить(Индекс);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Функция ИсключенияРеквизитов(ОбъектМетаданных, ИмяТабличнойЧасти = Неопределено)
	
	ИсключенияРеквизитов = ПоискИЗаменаДублейНСИ.ИсключенияРеквизитовСравнения();
	ПоискИЗаменаДублейНСИПереопределяемый.ПриОпределенииИсключенийРеквизитов(ИсключенияРеквизитов);
	
	Если ИмяТабличнойЧасти = Неопределено Тогда
		Отбор = Новый Структура("Метаданные,ИмяТабличнойЧасти", ОбъектМетаданных, "");
	Иначе
		Отбор = Новый Структура("Метаданные,ИмяТабличнойЧасти", ОбъектМетаданных, ИмяТабличнойЧасти);
	КонецЕсли;
	Результат = ИсключенияРеквизитов.Скопировать(Отбор, "ИмяРеквизита").ВыгрузитьКолонку(0);
	
	Возврат Результат;
	
КонецФункции

Процедура ПоднятьРеквизитыВНачалоСписка(Боковик)
	
	РеквизитыВОбратномПорядке = "Наименование,Код,Ссылка";
	
	Для Каждого ИмяРеквизита Из СтрРазделить(РеквизитыВОбратномПорядке, ",", Ложь) Цикл
		ИндексРеквизита = Боковик.НайтиПоЗначению(ИмяРеквизита);
		
		Если ИндексРеквизита <> Неопределено Тогда
			Боковик.Удалить(ИндексРеквизита);
			Боковик.Вставить(0, ИмяРеквизита);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Функция ДублиОтсортированные(Дубли)
	
	Результат = Новый ТаблицаЗначений;
	Результат.Колонки.Добавить("Дубль");
	Результат.Колонки.Добавить("Порядок");
	Результат.Колонки.Добавить("Статус");
	Результат.Колонки.Добавить("МестИспользования");
	
	ПорядокСтатусов = Новый Соответствие;
	ПорядокСтатусов.Вставить(ПоискИЗаменаДублейНСИКлиентСервер.СтатусОригинал(), 1);
	ПорядокСтатусов.Вставить(ПоискИЗаменаДублейНСИКлиентСервер.СтатусТребуетсяПодтверждение(), 2);
	ПорядокСтатусов.Вставить(ПоискИЗаменаДублейНСИКлиентСервер.СтатусНеЯвляетсяДублем(), 3);
	ПорядокСтатусов.Вставить(ПоискИЗаменаДублейНСИКлиентСервер.СтатусДубльЗаменить(), 4);
	ПорядокСтатусов.Вставить(ПоискИЗаменаДублейНСИКлиентСервер.СтатусДубльНеУдалять(), 5);
	
	Для Каждого Строка Из Дубли Цикл
		Если Не Строка.Пометка Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяСтрока = Результат.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
		НоваяСтрока.Порядок = ПорядокСтатусов[Строка.Статус];
	КонецЦикла;
	
	Результат.Сортировать("Порядок");
	Возврат Результат;
	
КонецФункции

Процедура ДополнитьКонтекстПоОсновнойТаблице(КонтекстФормированияОтчета, РезультатЗапроса, ОбъектМетаданных)
	
	Индексы = КонтекстФормированияОтчета.Индексы;
	РеквизитыВОтчет = Индексы.РеквизитыВОтчет;
	ТабличныеЧастиВОтчет = КонтекстФормированияОтчета.Индексы.ТабличныеЧастиВОтчет;
	ДополнительныеРеквизиты = КонтекстФормированияОтчета.ДополнительныеРеквизиты;
	
	КолонкиЗапроса = РезультатЗапроса.Колонки;
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		РеквизитыВОтчет.Вставить(Выборка.Ссылка, Новый Соответствие);
		
		Для Каждого Колонка Из КолонкиЗапроса Цикл
			ИмяКолонки = Колонка.Имя;
			
			Если ДополнительныеРеквизиты[ИмяКолонки] <> Неопределено Тогда
				ДополнитьИндексыПоТабличнойЧасти(КонтекстФормированияОтчета, Выборка, ИмяКолонки, "Ссылка");
				
			ИначеЕсли ТабличныеЧастиВОтчет[ИмяКолонки] <> Неопределено Тогда
				ДополнитьКонтекстТабличныхЧастей(ТабличныеЧастиВОтчет, ОбъектМетаданных, Выборка, ИмяКолонки);
				
			Иначе
				ДополнитьИндексыПоСтроке(Индексы, Выборка.Ссылка, ИмяКолонки, Выборка[ИмяКолонки]);
				
			КонецЕсли;
			
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

Процедура ДополнитьКонтекстПоСвязаннойТаблице(КонтекстФормированияОтчета, РезультатЗапроса, ОбъектМетаданных, ПолеСвязи)
	
	Индексы = КонтекстФормированияОтчета.Индексы;
	ТабличныеЧастиВОтчет = Индексы.ТабличныеЧастиВОтчет;
	ДополнительныеРеквизиты = КонтекстФормированияОтчета.ДополнительныеРеквизиты;
	
	КолонкиЗапроса = РезультатЗапроса.Колонки;
	ВыборкаГруппировкаПоПолюСвязи = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаГруппировкаПоПолюСвязи.Следующий() Цикл
		
		Выборка = ВыборкаГруппировкаПоПолюСвязи.Выбрать();
		
		Если Выборка.Следующий() Тогда
			СсылкаСвязанного = Выборка.Ссылка;
			
			Для Каждого Колонка Из КолонкиЗапроса Цикл
				ИмяКолонки = Колонка.Имя;
				Если ИмяКолонки = ПолеСвязи Тогда
					Продолжить;
				КонецЕсли;
				
				Если ДополнительныеРеквизиты[ИмяКолонки] <> Неопределено Тогда
					ДополнитьИндексыПоТабличнойЧасти(КонтекстФормированияОтчета, Выборка, ИмяКолонки, ПолеСвязи);
					
				ИначеЕсли ТабличныеЧастиВОтчет[ИмяКолонки] <> Неопределено Тогда
					ДополнитьКонтекстТабличныхЧастей(ТабличныеЧастиВОтчет, ОбъектМетаданных, Выборка, ИмяКолонки);
					
				Иначе
					ДополнитьИндексыПоСтроке(Индексы, Выборка[ПолеСвязи], ИмяКолонки, Выборка[ИмяКолонки]);
					
				КонецЕсли;
			КонецЦикла;
			
			СсылкаОсновного = ВыборкаГруппировкаПоПолюСвязи[ПолеСвязи];
			СсылкаСвязанного = Выборка.Ссылка;
			ПодменитьВладельцаТабличнойЧасти(ТабличныеЧастиВОтчет, СсылкаОсновного, СсылкаСвязанного);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ДополнитьКонтекстТабличныхЧастей(ТабличныеЧастиВОтчет, ОбъектМетаданных, Выборка, ИмяКолонки)
	
	ТабличнаяЧасть = Выборка[ИмяКолонки].Выгрузить(); //ТаблицаЗначений
	Если Не ТабличнаяЧасть.Количество() Тогда
		Возврат;
	КонецЕсли;
	
	ИсключенияРеквизитов = ИсключенияРеквизитов(ОбъектМетаданных, ИмяКолонки);
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(
		ИсключенияРеквизитов, ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве("Ссылка"), Истина);
	ИменаКолонок = Новый Массив;
	
	Для Каждого Колонка Из ТабличнаяЧасть.Колонки Цикл
		Если ИсключенияРеквизитов.Найти(Колонка.Имя) = Неопределено Тогда
			ИменаКолонок.Добавить(Колонка.Имя);
		КонецЕсли;
	КонецЦикла;
	
	Если ТабличныеЧастиВОтчет[ИмяКолонки] = ЗначениеПустая() Тогда
		ТабличныеЧастиВОтчет[ИмяКолонки] = Новый Соответствие;
	КонецЕсли;
	
	ТабличнаяЧасть = ТабличнаяЧасть.Скопировать(, СтрСоединить(ИменаКолонок, ","));
	ТабличныеЧастиВОтчет[ИмяКолонки].Вставить(Выборка.Ссылка, ТабличнаяЧасть);
	
КонецПроцедуры

Процедура ПодменитьВладельцаТабличнойЧасти(ТабличныеЧастиВОтчет, СсылкаОсновного, СсылкаСвязанного)
	
	Для Каждого ТабличнаяЧасть Из ТабличныеЧастиВОтчет Цикл
		Если ТабличнаяЧасть.Значение = ЗначениеПустая() Тогда
			Продолжить;
		КонецЕсли;
		
		Для Каждого СсылкиИТабличныеЧасти Из ТабличнаяЧасть.Значение Цикл
			
			Если СсылкиИТабличныеЧасти.Ключ = СсылкаСвязанного Тогда
				ТабличнаяЧасть.Значение.Вставить(СсылкаОсновного, СсылкиИТабличныеЧасти.Значение);
				ТабличнаяЧасть.Значение.Удалить(СсылкаСвязанного);
			КонецЕсли;
			
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

Процедура ДополнитьИндексыПоТабличнойЧасти(КонтекстФормированияОтчета, Выборка, ИмяТабличнойЧасти, ИмяКолонкиТабличнойЧасти)
	
	Индексы = КонтекстФормированияОтчета.Индексы;
	ДополнительныеРеквизиты = КонтекстФормированияОтчета.ДополнительныеРеквизиты;
	ИменаСинонимы = КонтекстФормированияОтчета.ИменаСинонимы;
	Боковик = КонтекстФормированияОтчета.Боковик;
	
	ВсеРеквизитыИЗначения = Индексы.ВсеРеквизитыИЗначения;
	
	РезультатЗапросаТЧ  = Выборка[ИмяТабличнойЧасти]; //РезультатЗапроса
	ВыборкаТЧ = РезультатЗапросаТЧ.Выбрать();
	Пока ВыборкаТЧ.Следующий() Цикл
		
		ХранениеИмяРеквизита = ДополнительныеРеквизиты[ИмяТабличнойЧасти].ИмяРеквизита;
		ХранениеЗначениеРеквизита = ДополнительныеРеквизиты[ИмяТабличнойЧасти].ЗначениеРеквизита;
		
		ИмяРеквизита = ВыборкаТЧ[ХранениеИмяРеквизита];
		Если ВсеРеквизитыИЗначения[ИмяРеквизита] = Неопределено Тогда
			ВсеРеквизитыИЗначения.Вставить(ИмяРеквизита, Новый Соответствие);
		КонецЕсли;
		
		ДополнитьИндексыПоСтроке(
			Индексы, Выборка[ИмяКолонкиТабличнойЧасти], ИмяРеквизита, ВыборкаТЧ[ХранениеЗначениеРеквизита]);
		
		ЭлементСписка = Боковик.НайтиПоЗначению(ИмяРеквизита);
		Если ЭлементСписка = Неопределено Тогда
			Боковик.Добавить(ИмяРеквизита);
		КонецЕсли;
		
		ИменаСинонимы.Вставить(ИмяРеквизита, ИмяРеквизита);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ДополнитьИндексыПоСтроке(Индексы, Ссылка, ИмяРеквизита, ЗначениеРеквизита)
	
	ЗначениеИКоличество = Индексы.ВсеРеквизитыИЗначения[ИмяРеквизита];
	Если ЗначениеИКоличество[ЗначениеРеквизита] = Неопределено Тогда
		ЗначениеИКоличество.Вставить(ЗначениеРеквизита, 0);
	КонецЕсли;
	ЗначениеИКоличество[ЗначениеРеквизита] = ЗначениеИКоличество[ЗначениеРеквизита] + 1;
	
	ПовторыЗначенийРеквизитов = Индексы.РеквизитыВОтчет[Ссылка];
	Если ПовторыЗначенийРеквизитов[ИмяРеквизита] = Неопределено
		Или Не ЗначениеЗаполнено(ПовторыЗначенийРеквизитов[ИмяРеквизита]) Тогда
		
		ПовторыЗначенийРеквизитов.Вставить(ИмяРеквизита, Новый Структура("ЗначениеПовторяется,ЗначениеРеквизита", Ложь));
		ПовторыЗначенийРеквизитов[ИмяРеквизита].ЗначениеРеквизита = ЗначениеРеквизита;
	КонецЕсли;
	
КонецПроцедуры

Процедура ДобавитьСвязьОбъектов(СвязиОбъектов, СтрокаСвязи)
	
	ИмяРеквизита = СтрокаСвязи.ПолеСвязи;
	ИмяСвязанногоОбъекта = СтрокаСвязи.СвязанныйОбъект.ПолноеИмя();
	МетаданныеОбъекта = СтрокаСвязи.СвязанныйОбъект;
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(МетаданныеОбъекта.СтандартныеРеквизиты, ИмяРеквизита) Тогда
		КоллекцияРеквизитов = МетаданныеОбъекта.СтандартныеРеквизиты;
	ИначеЕсли ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(МетаданныеОбъекта.Реквизиты, ИмяРеквизита) Тогда
		КоллекцияРеквизитов = МетаданныеОбъекта.Реквизиты;
	Иначе
		ТекстОшибки = НСтр("ru = 'Невозможно сформировать отчет о сравнении. Обратитесь к администратору.'");
		ИмяМетода = "ПоискИЗаменаДублейНСИПереопределяемый.ПриОпределенииСвязанныхОбъектов"; 
		ДляАдминистратора = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Не существует поле связи %1 в объекте метаданных %2. Связи должны быть описаны в методе %3.'"),
			ИмяРеквизита, ИмяСвязанногоОбъекта, ИмяМетода);
			
		ВызватьИсключение(ТекстОшибки, , , ДляАдминистратора);
	КонецЕсли;
	
	ТипыРеквизита = КоллекцияРеквизитов[ИмяРеквизита].Тип;
	Для каждого ТипРеквизита Из ТипыРеквизита.Типы() Цикл
		Запись = СвязиОбъектов.Добавить();
		Запись.Ключ = ИмяСвязанногоОбъекта;
		Запись.ТипРеквизита = ТипРеквизита;
		Запись.ИмяРеквизита = ИмяРеквизита;
		Запись.Метаданные = МетаданныеОбъекта;
	КонецЦикла;
	
КонецПроцедуры

Функция ПодготовитьБоковик(Знач Боковик, ВариантСравнения)
	
	Результат = Новый СписокЗначений;
	ДобавитьЭлементыПоПометке(Боковик, Результат, Истина);
	Если ВариантСравнения = "Все" Тогда
		ДобавитьЭлементыПоПометке(Боковик, Результат, Ложь);
	КонецЕсли;
	Возврат Результат;
	
КонецФункции

Процедура ДобавитьЭлементыПоПометке(Список, Результат, Пометка)
	
	Для Каждого ЭлементСписка Из Список Цикл
		Если ЭлементСписка.Пометка = Пометка Тогда
			ЗаполнитьЗначенияСвойств(Результат.Добавить(), ЭлементСписка);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#Область ВыводОтчета

Функция ПодготовитьОтчет(ДанныеФормированияОтчета)
	
	Боковик = ДанныеФормированияОтчета.Боковик;
	ИменаСинонимы = ДанныеФормированияОтчета.ИменаСинонимы;
	РеквизитыВОтчет = ДанныеФормированияОтчета.РеквизитыВОтчет;
	ТабличныеЧастиВОтчет = ДанныеФормированияОтчета.ТабличныеЧастиВОтчет;
	ДублиОтсортированные = ДанныеФормированияОтчета.ДублиОтсортированные;
	
	Результат = Новый ТабличныйДокумент;
	Шаблон = Обработки.ДублиНСИ.ПолучитьМакет("ШаблонОтчетаОСравнении");
	
	КонтекстРезультата = Новый Структура;
	КонтекстРезультата.Вставить("Результат", Результат);
	КонтекстРезультата.Вставить("Шаблон", Шаблон);
	
	// Заголовок
	ДобавитьТекст(КонтекстРезультата, "Заголовок", "Вывести", НСтр("ru = 'Реквизиты'"));
	ДобавитьТекст(КонтекстРезультата, "ПустаяСтрока", "Вывести");
	
	// Интерактивный блок
	ДобавитьТекст(КонтекстРезультата, "СтатусПервыйСтолбец", "Вывести", НСтр("ru = 'Статус'"));
	
	СмещениеКолонки = 3;
	СмещениеСтроки = 3;
	Для Каждого Строка Из ДублиОтсортированные Цикл
		Расшифровка = Новый Структура;
		Расшифровка.Вставить("РасшифровкаСтатуса");
		Расшифровка.Вставить("СтрокаНомер", СмещениеСтроки);
		Расшифровка.Вставить("КолонкаНомер", ДублиОтсортированные.Индекс(Строка) + СмещениеКолонки);
		Расшифровка.Вставить("Дубль", Строка.Дубль);
		
		ДобавитьЗначение(КонтекстРезультата, "СтатусПоследующийСтолбец", "Присоединить", Строка.Статус, Расшифровка);
	КонецЦикла;
	
	ДобавитьТекст(КонтекстРезультата, "МестИспользованияПервыйСтолбец", "Вывести", НСтр("ru = 'Мест использования'"));
	
	Для Каждого Строка Из ДублиОтсортированные Цикл
		Расшифровка = Новый Структура;
		Расшифровка.Вставить("РасшифровкаМестИспользования");
		Расшифровка.Вставить("Дубль", Строка.Дубль);
		
		Если ЗначениеЗаполнено(Строка.МестИспользования) Тогда
			МестаИспользования = Строка.МестИспользования;
		Иначе
			МестаИспользования = НСтр("ru = 'Места использования'");
		КонецЕсли;
		
		ДобавитьЗначение(КонтекстРезультата, "МестИспользованияПоследующийСтолбец", "Присоединить", МестаИспользования, Расшифровка);
	КонецЦикла;
	
	ДобавитьТекст(КонтекстРезультата, "ПустаяСтрока", "Вывести");
	
	// Реквизиты 
	ПерваяСтрока = Истина;
	Для Каждого ЭлементСписка Из Боковик Цикл
		
		ИмяРеквизита = ЭлементСписка.Значение;
		
		Если ПерваяСтрока Тогда
			ДобавитьТекст(КонтекстРезультата, "ШапкаПервыйСтолбец", "Вывести", НСтр("ru = 'Реквизит'"));
			Результат.НачатьГруппуСтрок();
		Иначе
			Если ЭлементСписка.Пометка Тогда
				ДобавитьТекст(КонтекстРезультата, "ЯчейкаПервыйСтолбец", "Вывести", ИменаСинонимы[ИмяРеквизита]);
			Иначе
				ДобавитьТекст(КонтекстРезультата, "ЯчейкаПервыйПовторяющийсяСтолбец", "Вывести", ИменаСинонимы[ИмяРеквизита]);
			КонецЕсли;
		КонецЕсли;
		
		Для Каждого Строка Из ДублиОтсортированные Цикл
			ДанныеДубля = РеквизитыВОтчет[Строка.Дубль][ИмяРеквизита];
			Если ДанныеДубля = Неопределено Тогда
				ДобавитьТекст(КонтекстРезультата, "ЯчейкаПоследующийСтолбец", "Присоединить");
				Продолжить;
			КонецЕсли;
			
			ЗначениеРеквизита = ДанныеДубля.ЗначениеРеквизита;
			
			Если ПерваяСтрока Тогда
				ДобавитьЗначение(КонтекстРезультата, "ШапкаПоследующийСтолбец", "Присоединить", ЗначениеРеквизита, ЗначениеРеквизита);
			Иначе
				Если ДанныеДубля.ЗначениеПовторяется Тогда
					ДобавитьТекст(КонтекстРезультата, "ЯчейкаПоследующийПовторяющийсяСтолбец", "Присоединить", ЗначениеРеквизита);
				Иначе
					ДобавитьЗначение(КонтекстРезультата, "ЯчейкаПоследующийСтолбец", "Присоединить", ЗначениеРеквизита, ЗначениеРеквизита);
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
		ПерваяСтрока = Ложь;
		
	КонецЦикла;
	
	Результат.ЗакончитьГруппуСтрок();
	
	// Табличные части
	Для Каждого ДанныеТабличнойЧасти Из ТабличныеЧастиВОтчет Цикл
		
		Если ДанныеТабличнойЧасти.Значение = ЗначениеПустая() Тогда 
			Продолжить;
		КонецЕсли;
		
		ДобавитьТекст(КонтекстРезультата, "ПустаяСтрока", "Вывести");
		ДобавитьТекст(КонтекстРезультата, "Заголовок", "Вывести", ИменаСинонимы[ДанныеТабличнойЧасти.Ключ]);
		
		Результат.НачатьГруппуСтрок();
		
		Для Каждого Строка Из ДублиОтсортированные Цикл
			
			ТабличнаяЧасть = ДанныеТабличнойЧасти.Значение[Строка.Дубль];
			Если ТабличнаяЧасть = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			ДобавитьТекст(КонтекстРезультата, "ПустаяСтрока", "Вывести");
			ДобавитьТекст(КонтекстРезультата, "ЗаголовокТабличнойЧасти", "Вывести", Строка(Строка.Дубль));
			
			// Шапка табличной части
			ПерваяКолонка = Истина;
			Для Каждого Колонка Из ТабличнаяЧасть.Колонки Цикл
				Если ПерваяКолонка Тогда
					ДобавитьТекст(КонтекстРезультата, "ШапкаТЧПервыйСтолбец", "Вывести");
					ПерваяКолонка = Ложь;
				Иначе
					ДобавитьТекст(КонтекстРезультата, "ШапкаТЧПоследующийСтолбец", "Присоединить", Колонка.Имя);
				КонецЕсли;
			КонецЦикла;
			
			// Строки табличной части
			Для Каждого СтрокаТЧ Из ТабличнаяЧасть Цикл 
				ПерваяКолонка = Истина;
				
				Для Каждого Колонка Из ТабличнаяЧасть.Колонки Цикл
					Если ПерваяКолонка Тогда
						ДобавитьТекст(КонтекстРезультата, "ЯчейкаТЧПервыйСтолбец", "Вывести", СтрокаТЧ[Колонка.Имя]);
						ПерваяКолонка = Ложь;
					Иначе
						ДобавитьТекст(КонтекстРезультата, "ЯчейкаТЧПоследующийСтолбец", "Присоединить", СтрокаТЧ[Колонка.Имя]);
					КонецЕсли;
				КонецЦикла;
			КонецЦикла;
			
		КонецЦикла;
		
		Результат.ЗакончитьГруппуСтрок();
		
	КонецЦикла;
	
	Результат.ФиксацияСлева = СмещениеКолонки - 1;
	Результат.ФиксацияСверху = СмещениеСтроки + 3;
	
	Возврат Результат;
	
КонецФункции

Процедура ДобавитьТекст(КонтекстРезультата, ИмяОбласти, СпособВывода, Текст = Неопределено)
	
	Область = КонтекстРезультата.Шаблон.ПолучитьОбласть(ИмяОбласти);
	Если Текст <> Неопределено Тогда
		Область.ТекущаяОбласть.Текст = Текст;
	КонецЕсли;
	ВывестиОбласть(КонтекстРезультата, Область, СпособВывода);
	
КонецПроцедуры

Процедура ДобавитьЗначение(КонтекстРезультата, ИмяОбласти, СпособВывода, Значение, Расшифровка = Неопределено)
	
	Область = КонтекстРезультата.Шаблон.ПолучитьОбласть(ИмяОбласти);
	Область.ТекущаяОбласть.Значение = Значение;
	Если Не ЭтоЗначениеПримитивногоТипа(Расшифровка) Тогда
		Область.ТекущаяОбласть.Расшифровка = Расшифровка;
	КонецЕсли;
	ВывестиОбласть(КонтекстРезультата, Область, СпособВывода);
	
КонецПроцедуры

Процедура ВывестиОбласть(КонтекстРезультата, Область, СпособВывода)
	
	Если СпособВывода = "Вывести" Тогда
		КонтекстРезультата.Результат.Вывести(Область);
	ИначеЕсли СпособВывода = "Присоединить" Тогда
		КонтекстРезультата.Результат.Присоединить(Область);
	КонецЕсли;
	
КонецПроцедуры

// Проверяет, является ли переданное значение примитивного типа.
//
// Параметры:
//   Значение - Произвольный - Проверяемое значение
//
// Возвращаемое значение:
//   Булево - Истина, если значение имеет примитивный тип, иначе Ложь
//
Функция ЭтоЗначениеПримитивногоТипа(Значение)
	
	ПроверяемыйТип = ТипЗнч(Значение);
	
	Если ПроверяемыйТип = Тип("Неопределено")
		Или ПроверяемыйТип = Тип("Булево")
		Или ПроверяемыйТип = Тип("Строка")
		Или ПроверяемыйТип = Тип("Число")
		Или ПроверяемыйТип = Тип("Дата")
		Или ПроверяемыйТип = Тип("УникальныйИдентификатор") Тогда
		
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

#КонецОбласти

Функция ЗначениеПустая()
	Возврат "Пустая";
КонецФункции

#КонецОбласти

#Область ПодтверждениеДублей

// Параметры:
//  Дубли - ТаблицаЗначений
//  ТипСсылки - СправочникСсылка.ИдентификаторыОбъектовМетаданных
//  СПроверкой - Булево
// 
// Возвращаемое значение:
//  Структура - Подтвердить дубли:
// * ВозможноПодтверждение - Булево
// * ОшибкиВыбораСтатуса - ТаблицаЗначений:
//   ** ТекстОшибки - Строка
//   ** Поле - Строка - путь к элементу формы для привязки соощения.
// * ТекстПредупрежденияОПовторномПоиске - Строка
// * ТекстПредупрежденияОНесоответствии - Строка
//
Функция ПодтвердитьДубли(Дубли, ТипСсылки, СПроверкой = Истина) Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("ВозможноПодтверждение", Истина);
	Ошибки = Новый ТаблицаЗначений;
	Ошибки.Колонки.Добавить("ТекстОшибки", Новый ОписаниеТипов("Строка"));
	Ошибки.Колонки.Добавить("Поле", Новый ОписаниеТипов("Строка"));
	Результат.Вставить("ОшибкиВыбораСтатуса", Ошибки);
	Результат.Вставить("ТекстПредупрежденияОПовторномПоиске", "");
	Результат.Вставить("ТекстПредупрежденияОНесоответствии", "");
	
	ПроверитьПодлинностьДублей(Дубли, Результат);
	Если Не Результат.ВозможноПодтверждение Тогда
		Возврат Результат;
	КонецЕсли;
	
	Если СПроверкой Тогда
		ПроверитьВозможностьПодтвержденияДублей(Дубли, Результат);
	КонецЕсли;
	Если Не Результат.ВозможноПодтверждение Тогда
		Возврат Результат;
	КонецЕсли;
	
	Оригинал = ПоискИЗаменаДублейНСИКлиентСервер.СтатусОригинал();
	ДубльЗаменить = ПоискИЗаменаДублейНСИКлиентСервер.СтатусДубльЗаменить();
	ДубльНеУдалять = ПоискИЗаменаДублейНСИКлиентСервер.СтатусДубльНеУдалять();
	ТребуетсяПодтверждение = ПоискИЗаменаДублейНСИКлиентСервер.СтатусТребуетсяПодтверждение();
	
	Отбор = Новый Структура("Статус", Оригинал);
	Оригиналы = Дубли.НайтиСтроки(Отбор);
	Если Оригиналы.Количество() = 1 Тогда
		ОригинальныйЭлемент = Оригиналы[0].Дубль;
	Иначе
		ТаблицаДублей = Дубли.Выгрузить();
		РегистрыСведений.ДублиНСИКПодтверждению.УдалитьДубли(
			ТаблицаДублей.ВыгрузитьКолонку("ГруппаДублей"),
			ТаблицаДублей.ВыгрузитьКолонку("Дубль"));
		Возврат Результат;
	КонецЕсли;
	
	ГруппыКУдалению = Новый Массив;
	ДублиКУдалению = Новый Массив;
	ПодтвержденныеДубли = РегистрыСведений.ДублиНСИ.ШаблонНабораЗаписей();
	Для Каждого СтрокаТаблицы Из Дубли Цикл
		
		СтатусВСтроке = СтрокаТаблицы.Статус;
		
		Если СтатусВСтроке <> ТребуетсяПодтверждение Тогда
			ОбщегоНазначенияКлиентСервер.ДополнитьМассив(
				ГруппыКУдалению,
				ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(СтрокаТаблицы.ГруппаДублей), Истина);
			ОбщегоНазначенияКлиентСервер.ДополнитьМассив(
				ДублиКУдалению,
				ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(СтрокаТаблицы.Дубль), Истина);
		КонецЕсли;
		
		Если СтатусВСтроке = ДубльЗаменить Тогда
			СостояниеУдаленияДубля = Перечисления.СостоянияУдаленияДублейНСИ.ЗапланированаЗаменаСсылокИУдаление;
		ИначеЕсли СтатусВСтроке = ДубльНеУдалять Тогда
			СостояниеУдаленияДубля = Перечисления.СостоянияУдаленияДублейНСИ.УдалениеНеПланируется;
		Иначе
			Продолжить;
		КонецЕсли;
		
		НоваяСтрока = ПодтвержденныеДубли.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы);
		НоваяСтрока.Оригинал = ОригинальныйЭлемент;
		НоваяСтрока.СостояниеУдаленияДубля = СостояниеУдаленияДубля;
		НоваяСтрока.ТипСсылки = ТипСсылки;
		
	КонецЦикла;
	
	КоличествоДублейКУдалению = ДублиКУдалению.Количество();
	КоличествоДублей = Дубли.Количество();
	Если КоличествоДублейКУдалению = 0
		Или КоличествоДублейКУдалению = КоличествоДублей Тогда
		ДублиКУдалению = Неопределено;
	КонецЕсли;
	Если КоличествоДублейКУдалению <> КоличествоДублей Тогда
		ДублиКУдалению = ОбщегоНазначенияКлиентСервер.РазностьМассивов(
			ДублиКУдалению,
			ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ОригинальныйЭлемент));
	КонецЕсли;
	
	НачатьТранзакцию();
	Попытка
		РегистрыСведений.ДублиНСИ.УдалитьДубли(Дубли.Выгрузить(, "Дубль"));
		РегистрыСведений.ДублиНСИ.ДобавитьДубли(ПодтвержденныеДубли);
		РегистрыСведений.ДублиНСИКПодтверждению.УдалитьДубли(ГруппыКУдалению, ДублиКУдалению);
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

Процедура ПроверитьПодлинностьДублей(Дубли, Результат)
	
	ДублиВМассиве = Новый Массив;
	Для Каждого Строка Из Дубли Цикл
		ДублиВМассиве.Добавить(Строка.Дубль);
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДублиНСИКПодтверждению.Дубль КАК Дубль
	|ИЗ
	|	РегистрСведений.ДублиНСИКПодтверждению КАК ДублиНСИКПодтверждению
	|ГДЕ
	|	ДублиНСИКПодтверждению.Дубль В (&ДублиВМассиве)
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ДублиНСИ.Дубль
	|ИЗ
	|	РегистрСведений.ДублиНСИ КАК ДублиНСИ
	|ГДЕ
	|	ДублиНСИ.Дубль В (&ДублиВМассиве)
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ДублиНСИ.Оригинал
	|ИЗ
	|	РегистрСведений.ДублиНСИ КАК ДублиНСИ
	|ГДЕ
	|	ДублиНСИ.Оригинал В (&ДублиВМассиве)";
	Запрос.УстановитьПараметр("ДублиВМассиве", ДублиВМассиве);
	
	СуществующиеДубли = Запрос.Выполнить().Выбрать();
	
	Если СуществующиеДубли.Количество() <> Дубли.Количество() Тогда
		Результат.ВозможноПодтверждение = Ложь;
		Результат.ТекстПредупрежденияОНесоответствии = НСтр("ru = 'Подтверждение невозможно: часть дублирующих записей отсутствует в базе данных.
			|Возможно, они были изменены или удалены другим пользователем.'");
	КонецЕсли;
	
КонецПроцедуры

// Параметры:
//  Дубли - ТаблицаЗначений
//  РезультатПроверки - Структура:
// * ВозможноПодтверждение - Булево
// * ОшибкиВыбораСтатуса - ТаблицаЗначений:
//   ** ТекстОшибки - Строка
//   ** Поле - Строка
// * ТекстПредупрежденияОПовторномПоиске - Строка
// * ТекстПредупрежденияОНесоответствии - Строка
//
Процедура ПроверитьВозможностьПодтвержденияДублей(Дубли, РезультатПроверки)
	
	Если Не СтатусыРасставленыКорректно(Дубли, РезультатПроверки) Тогда
		Возврат;
	КонецЕсли;
	
	Оригинал = Неопределено;
	ДублиКПроверке = ДублиКПроверке(Дубли, Оригинал);
	Источники = Источники(Дубли);
	СтруктураПредупреждений = ПроверитьПовторноНайденныеПоПравилу(Источники, ДублиКПроверке, Оригинал);
	Если СтруктураПредупреждений.Количество() > 0 Тогда
		СформироватьПредупреждениеОПовторномПоиске(СтруктураПредупреждений, РезультатПроверки);
		Возврат;
	КонецЕсли;
	
	ПроверитьИзмененныеПодтвержденныеСтатусы(Дубли, Оригинал, РезультатПроверки);
	
КонецПроцедуры

Функция СтатусыРасставленыКорректно(Дубли, РезультатПроверки)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаДублей.Дубль КАК Дубль,
	|	ВЫРАЗИТЬ(ТаблицаДублей.Статус КАК СТРОКА(100)) КАК Статус
	|ПОМЕСТИТЬ ВТДубли
	|ИЗ
	|	&ТаблицаДублей КАК ТаблицаДублей
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТДубли.Дубль КАК Дубль
	|ИЗ
	|	ВТДубли КАК ВТДубли
	|ГДЕ
	|	ВТДубли.Статус = &СтатусОригинал
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТДубли.Дубль КАК Дубль
	|ИЗ
	|	ВТДубли КАК ВТДубли
	|ГДЕ
	|	ВТДубли.Статус В (&СтатусДубльЗаменить, &СтатусДубльНеУдалять)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТДубли.Дубль КАК Дубль
	|ИЗ
	|	ВТДубли КАК ВТДубли
	|ГДЕ
	|	ВТДубли.Статус = &СтатусНеЯвляетсяДублем
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТДубли";
	Запрос.УстановитьПараметр("ТаблицаДублей", Дубли.Выгрузить());
	Запрос.УстановитьПараметр("СтатусОригинал", ПоискИЗаменаДублейНСИКлиентСервер.СтатусОригинал());
	Запрос.УстановитьПараметр("СтатусДубльЗаменить", ПоискИЗаменаДублейНСИКлиентСервер.СтатусДубльЗаменить());
	Запрос.УстановитьПараметр("СтатусДубльНеУдалять", ПоискИЗаменаДублейНСИКлиентСервер.СтатусДубльНеУдалять());
	Запрос.УстановитьПараметр("СтатусНеЯвляетсяДублем", ПоискИЗаменаДублейНСИКлиентСервер.СтатусНеЯвляетсяДублем());
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	ВыборкаОригинал = РезультатЗапроса[1].Выбрать();
	Если ВыборкаОригинал.Количество() = 0 И РезультатЗапроса[3].Пустой() Тогда
		НовСтрока = РезультатПроверки.ОшибкиВыбораСтатуса.Добавить();
		НовСтрока.ТекстОшибки = НСтр("ru = 'Один элемент из списка должен быть отмечен как оригинал.'");
		НовСтрока.Поле = "Дубли[0].Статус";
		РезультатПроверки.ВозможноПодтверждение = Ложь;
		Возврат Ложь;
	ИначеЕсли ВыборкаОригинал.Количество() > 1 Тогда
		НовСтрока = РезультатПроверки.ОшибкиВыбораСтатуса.Добавить();
		НовСтрока.ТекстОшибки = НСтр("ru = 'Подтверждение дублей возможно только с одним оригиналом.'");
		НовСтрока.Поле = "Дубли[0].Статус";
		РезультатПроверки.ВозможноПодтверждение = Ложь;
		Возврат Ложь;
	КонецЕсли;
	
	Если РезультатЗапроса[2].Пустой() И РезультатЗапроса[3].Пустой() Тогда
		НовСтрока = РезультатПроверки.ОшибкиВыбораСтатуса.Добавить();
		НовСтрока.ТекстОшибки = НСтр("ru = 'Не выбрано ни одного дубля для подтверждения.'");
		НовСтрока.Поле = "Дубли[0].Статус";
		РезультатПроверки.ВозможноПодтверждение = Ложь;
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

Функция ДублиКПроверке(Дубли, Оригинал)
	
	СтатусОригинал = ПоискИЗаменаДублейНСИКлиентСервер.СтатусОригинал();
	СтатусНеЯвляетсяДублем = ПоискИЗаменаДублейНСИКлиентСервер.СтатусНеЯвляетсяДублем();
	
	ДублиКПроверке = Новый Массив;
	
	Для Каждого Строка Из Дубли Цикл
		Если Строка.Статус = СтатусНеЯвляетсяДублем Или Строка.Статус = СтатусОригинал Тогда
			ДублиКПроверке.Добавить(Строка.Дубль);
		КонецЕсли;
		
		Если Строка.Статус = СтатусОригинал Тогда
			Оригинал = Строка.Дубль;
		КонецЕсли;
	КонецЦикла;
	
	Возврат ОбщегоНазначенияКлиентСервер.СвернутьМассив(ДублиКПроверке);
	
КонецФункции

Функция Источники(Дубли)
	
	СтатусОригинал = ПоискИЗаменаДублейНСИКлиентСервер.СтатусОригинал();
	СтатусНеЯвляетсяДублем = ПоискИЗаменаДублейНСИКлиентСервер.СтатусНеЯвляетсяДублем();
	
	Источники = Новый Массив;
	
	Для Каждого Строка Из Дубли Цикл
		Если Строка.Статус = СтатусНеЯвляетсяДублем Или Строка.Статус = СтатусОригинал Тогда
			Источники.Добавить(Строка.Источник); 
		КонецЕсли;
	КонецЦикла;
	
	Возврат ОбщегоНазначенияКлиентСервер.СвернутьМассив(Источники);
	
КонецФункции

Функция ПроверитьПовторноНайденныеПоПравилу(Источники, ДублиКПроверке, Оригинал)
	
	СтруктураПредупреждений = Новый Соответствие;
	
	Для Каждого Источник Из Источники Цикл
		Если ТипЗнч(Источник) = Тип("СправочникСсылка.ПравилаПоискаДублейНСИ") Тогда
			
			Запрос = Справочники.ПравилаПоискаДублейНСИ.СформироватьЗапросПоПравилу(
				Источник, Истина, ДублиКПроверке);
			ДублиПоПравилу = Запрос.Выполнить().Выбрать();
			
			ПовторноНайденныеПоПравилу = Новый Массив;
			ЕстьЗаписи = Ложь;
			
			Пока ДублиПоПравилу.Следующий() Цикл
				ЕстьЗаписи = Истина;
				Если ДублиПоПравилу.Ссылка <> Оригинал Тогда
					ПовторноНайденныеПоПравилу.Добавить(ДублиПоПравилу.Ссылка);
				КонецЕсли;
				Если ДублиПоПравилу.Ссылка1 <> Оригинал Тогда
					ПовторноНайденныеПоПравилу.Добавить(ДублиПоПравилу.Ссылка1);
				КонецЕсли;
			КонецЦикла;
			
			Если ЕстьЗаписи Тогда
				ПовторноНайденныеПоПравилу = ОбщегоНазначенияКлиентСервер.СвернутьМассив(
					ПовторноНайденныеПоПравилу);
				СтруктураПредупреждений.Вставить(Источник, ПовторноНайденныеПоПравилу);
			КонецЕсли;
			
		КонецЕсли;
	КонецЦикла;
	
	Возврат СтруктураПредупреждений;
	
КонецФункции

Процедура СформироватьПредупреждениеОПовторномПоиске(СтруктураПредупреждений, РезультатПроверки)
	
	ШаблонДляЭлементов = НСтр("ru = 'Для элементов ""%1"" установлен статус ""Не является дублем"".'");
	ШаблонДляЭлемента = НСтр("ru = 'Для элемента ""%1"" установлен статус ""Не является дублем"".'");
	
	ШаблонПриСледующемПоискеЭлементаПоПравилу = НСтр(
		"ru = 'При следующем поиске по правилу ""%1"" элемент повторно будет добавлен как дубль к подтверждению.'");
	ШаблонПриСледующемПоискеЭлементовПоПравилу = НСтр(
		"ru = 'При следующем поиске по правилу ""%1"" элементы повторно будут добавлены как дубли к подтверждению.'");
	
	Рекомендация = НСтр("ru = 'Чтобы исключить повторную регистрацию дубля, рекомендуется уточнить значения реквизитов элемента или условие в правиле поиска дублей.
		|Продолжить?'");
	
	ЧастиПредупреждения = Новый Массив;
	Для каждого Предупреждение Из СтруктураПредупреждений Цикл
		КоличествоЭлементов = Предупреждение.Значение.Количество();
		
		Если КоличествоЭлементов = 1 Тогда
			ЧастиПредупреждения.Добавить(СтрШаблон(ШаблонДляЭлемента, Предупреждение.Значение[0]));
			ЧастиПредупреждения.Добавить(СтрШаблон(ШаблонПриСледующемПоискеЭлементаПоПравилу, 
				Предупреждение.Ключ));
		ИначеЕсли КоличествоЭлементов > 1 Тогда
			ЧастиПредупреждения.Добавить(СтрШаблон(ШаблонДляЭлементов, 
				СтрСоединить(Предупреждение.Значение, ", ")));
			ЧастиПредупреждения.Добавить(СтрШаблон(ШаблонПриСледующемПоискеЭлементовПоПравилу, 
				Предупреждение.Ключ));
		КонецЕсли;
	КонецЦикла;
	
	ЧастиПредупреждения.Добавить(Рекомендация);
	РезультатПроверки.ТекстПредупрежденияОПовторномПоиске = СтрСоединить(ЧастиПредупреждения, Символы.ПС);
	РезультатПроверки.ВозможноПодтверждение = Ложь;
	
КонецПроцедуры

Процедура ПроверитьИзмененныеПодтвержденныеСтатусы(Дубли, Оригинал, РезультатПроверки)
	
	ДублиОтбор = ДублиПодтвержденные(Дубли);
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДублиНСИ.Оригинал КАК Оригинал
	|ИЗ
	|	РегистрСведений.ДублиНСИ КАК ДублиНСИ
	|ГДЕ
	|	ДублиНСИ.Оригинал В (&ДублиОтбор)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДублиНСИ.Дубль КАК Дубль
	|ИЗ
	|	РегистрСведений.ДублиНСИ КАК ДублиНСИ
	|ГДЕ
	|	ДублиНСИ.Дубль = &ОригиналОтбор";
	Запрос.УстановитьПараметр("ДублиОтбор", ДублиОтбор);
	Запрос.УстановитьПараметр("ОригиналОтбор", Оригинал);
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	ТаблицаДублей = Дубли.Выгрузить();
	
	ВыборкаОригиналы = РезультатЗапроса[0].Выбрать();
	Пока ВыборкаОригиналы.Следующий() Цикл
		НовСтрока = РезультатПроверки.ОшибкиВыбораСтатуса.Добавить();
		НовСтрока.ТекстОшибки = НСтр("ru = 'Элемент подтвержден как оригинал, смена статуса невозможна'");
		СтрокаПоиск = ТаблицаДублей.Найти(ВыборкаОригиналы.Оригинал, "Дубль"); 
		НомерСтроки = ТаблицаДублей.Индекс(СтрокаПоиск);
		Если НомерСтроки <> Неопределено Тогда
			НовСтрока.Поле = "Дубли[" + НомерСтроки + "].Статус";
		Иначе
			НовСтрока.Поле = "Дубли[0].Статус";
		КонецЕсли;
	КонецЦикла;
	
	ВыборкаДубли = РезультатЗапроса[1].Выбрать();
	Пока ВыборкаДубли.Следующий() Цикл
		НовСтрока = РезультатПроверки.ОшибкиВыбораСтатуса.Добавить();
		НовСтрока.ТекстОшибки = НСтр("ru = 'Элемент подтвержден как дубль, смена статуса невозможна'");
		СтрокаПоиск = ТаблицаДублей.Найти(ВыборкаДубли.Дубль, "Дубль"); 
		НомерСтроки = ТаблицаДублей.Индекс(СтрокаПоиск);
		Если НомерСтроки <> Неопределено Тогда
			НовСтрока.Поле = "Дубли[" + НомерСтроки + "].Статус";
		Иначе
			НовСтрока.Поле = "Дубли[0].Статус";
		КонецЕсли;
	КонецЦикла;
	
	Если РезультатПроверки.ОшибкиВыбораСтатуса.Количество() > 0 Тогда
		РезультатПроверки.ВозможноПодтверждение = Ложь;
	КонецЕсли;
	
КонецПроцедуры

Функция ДублиПодтвержденные(Дубли)
	
	СтатусДубльЗаменить = ПоискИЗаменаДублейНСИКлиентСервер.СтатусДубльЗаменить();
	СтатусДубльНеУдалять = ПоискИЗаменаДублейНСИКлиентСервер.СтатусДубльНеУдалять();
	
	ДублиОтбор = Новый Массив;
	
	Для Каждого Строка Из Дубли Цикл
		СтатусСтроки = Строка.Статус;
		
		Если СтатусСтроки = СтатусДубльЗаменить Или СтатусСтроки = СтатусДубльНеУдалять Тогда
			ДублиОтбор.Добавить(Строка.Дубль);
		КонецЕсли;
	КонецЦикла;
	
	Возврат ДублиОтбор;
	
КонецФункции

#КонецОбласти

#Область РабочееМесто

// Возвращает данные для заполнения формы сравнения дублей НСИ по указанным группам и типу справочника.
//
// Параметры:
//   ИдентификаторыГрупп - Строка
//                       - Массив из Строка - идентификаторы групп дублей для выборки.
//   ТипСправочника - Строка - Идентификатор типа справочника (метаданные).
//
// Возвращаемое значение:
//   ТаблицаЗначений - данные дублей:
//      *Дубль - СправочникСсылка,ПланВидовХарактеристикСсылка
//      *ГруппаДублей - Строка
//      *Источник - СправочникСсылка.ПравилаПоискаДублейНСИ,СправочникСсылка.Пользователи
//      *КоличествоМестИспользования - Число
//      *ДатаПоискаМестИспользования - Дата
//      *МестИспользования - Строка
//      *Статус - Строка
//      *Наименование - Строка
//      *Код - Строка
//
Функция ДанныеЗаполненияФормыСравненияДублей(ИдентификаторыГрупп, ТипСправочника) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДублиНСИКПодтверждению.Дубль КАК Дубль
	|ПОМЕСТИТЬ ВсеСвязанныеДубли
	|ИЗ
	|	РегистрСведений.ДублиНСИКПодтверждению КАК ДублиНСИКПодтверждению
	|ГДЕ
	|	ДублиНСИКПодтверждению.ГруппаДублей В (&ГруппыОтбор)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДублиНСИКПодтверждению.Дубль КАК Дубль,
	|	ДублиНСИКПодтверждению.ГруппаДублей КАК ГруппаДублей,
	|	ДублиНСИКПодтверждению.Источник КАК Источник,
	|	ДублиНСИКПодтверждению.КоличествоМестИспользования КАК КоличествоМестИспользования,
	|	ДублиНСИКПодтверждению.ДатаПоискаМестИспользования КАК ДатаПоискаМестИспользования,
	|	ВЫРАЗИТЬ("""" КАК СТРОКА(200)) КАК МестИспользования,
	|	ВЫРАЗИТЬ("""" КАК СТРОКА(200)) КАК Статус,
	|	ВЫРАЗИТЬ("""" КАК СТРОКА(200)) КАК Наименование,
	|	ВЫРАЗИТЬ("""" КАК СТРОКА(200)) КАК Код
	|ИЗ
	|	РегистрСведений.ДублиНСИКПодтверждению КАК ДублиНСИКПодтверждению
	|ГДЕ
	|	ДублиНСИКПодтверждению.Дубль В
	|		(ВЫБРАТЬ
	|			Т.Дубль
	|		ИЗ
	|			ВсеСвязанныеДубли КАК Т)";
	Запрос.УстановитьПараметр("ГруппыОтбор", ИдентификаторыГрупп);
	
	УстановитьПривилегированныйРежим(Истина);
	ТаблицаРезультат = Запрос.Выполнить().Выгрузить();
	УстановитьПривилегированныйРежим(Ложь);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДублиНСИ.Дубль КАК Дубль,
	|	ДублиНСИ.Оригинал КАК Оригинал,
	|	ДублиНСИ.СостояниеУдаленияДубля КАК СостояниеУдаленияДубля,
	|	ДублиНСИ.КоличествоМестИспользования КАК КоличествоМестИспользования,
	|	ДублиНСИ.ДатаПоискаМестИспользования КАК ДатаПоискаМестИспользования
	|ИЗ
	|	РегистрСведений.ДублиНСИ КАК ДублиНСИ
	|ГДЕ
	|	ДублиНСИ.Оригинал В
	|		(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|			Т.Оригинал
	|		ИЗ
	|			РегистрСведений.ДублиНСИ КАК Т
	|		ГДЕ
	|			ДублиНСИ.Оригинал В (&Дубли))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДублиНСИ.Дубль КАК Дубль,
	|	ДублиНСИ.Оригинал КАК Оригинал,
	|	ДублиНСИ.СостояниеУдаленияДубля КАК СостояниеУдаленияДубля,
	|	ДублиНСИ.КоличествоМестИспользования КАК КоличествоМестИспользования,
	|	ДублиНСИ.ДатаПоискаМестИспользования КАК ДатаПоискаМестИспользования
	|ИЗ
	|	РегистрСведений.ДублиНСИ КАК ДублиНСИ
	|ГДЕ
	|	ДублиНСИ.Дубль В (&Дубли)";
	
	Запрос.УстановитьПараметр("Дубли", ТаблицаРезультат.ВыгрузитьКолонку("Дубль"));
	УстановитьПривилегированныйРежим(Истина);
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	УстановитьПривилегированныйРежим(Ложь);
	
	ОбработатьОригиналы(ТаблицаРезультат, РезультатЗапроса[0].Выбрать());
	ОбработатьДубли(ТаблицаРезультат, РезультатЗапроса[1].Выбрать());
	
	МетаданныеОбъекта = ОбщегоНазначения.ОбъектМетаданныхПоИдентификатору(ТипСправочника);
	ПроверкаСтандартныхРеквизитов = КодНаименование();
	ЗаполнитьЗначенияСвойств(ПроверкаСтандартныхРеквизитов, МетаданныеОбъекта.СтандартныеРеквизиты);
	
	МассивРеквизитов = Новый Массив;
	Для Каждого Проверка Из ПроверкаСтандартныхРеквизитов Цикл
		Если Проверка.Значение <> Неопределено Тогда
			МассивРеквизитов.Добавить(Проверка.Ключ); 
		КонецЕсли;
	КонецЦикла;
	
	Дубли = ТаблицаРезультат.ВыгрузитьКолонку("Дубль");
	РеквизитыДублей = ОбщегоНазначения.ЗначенияРеквизитовОбъектов(Дубли, СтрСоединить(МассивРеквизитов, ","));
	
	Для Каждого СтрокаТаблицы Из ТаблицаРезультат Цикл
		РеквизитыОбъекта = КодНаименование();
		ЗаполнитьЗначенияСвойств(РеквизитыОбъекта, РеквизитыДублей[СтрокаТаблицы.Дубль]);
		СтрокаТаблицы.Код = РеквизитыОбъекта.Код;
		СтрокаТаблицы.Наименование = РеквизитыОбъекта.Наименование;
		СтрокаТаблицы.МестИспользования = ПредставлениеМестИспользования(
			СтрокаТаблицы.КоличествоМестИспользования, СтрокаТаблицы.ДатаПоискаМестИспользования);
		
		Если Не ЗначениеЗаполнено(СтрокаТаблицы.Статус) Тогда
			СтрокаТаблицы.Статус = ПоискИЗаменаДублейНСИКлиентСервер.СтатусТребуетсяПодтверждение();
		КонецЕсли;
	КонецЦикла;
	
	Возврат ТаблицаРезультат;
	
КонецФункции

Процедура ОбработатьОригиналы(ТаблицаРезультат, Выборка)
	
	Пока Выборка.Следующий() Цикл
		СтрокиСОригиналами = ТаблицаРезультат.НайтиСтроки(Новый Структура("Дубль", Выборка.Оригинал));
		Для Каждого СтрокаСОригиналом Из СтрокиСОригиналами Цикл
			СтрокаСОригиналом.Статус = ПоискИЗаменаДублейНСИКлиентСервер.СтатусОригинал();
		КонецЦикла;
		
		ДобавитьСтрокуЕслиОтсутствует(ТаблицаРезультат, Выборка.Дубль, 
			Выборка.ДатаПоискаМестИспользования, Выборка.КоличествоМестИспользования);
		ДобавитьСтрокуЕслиОтсутствует(ТаблицаРезультат, Выборка.Оригинал);
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбработатьДубли(ТаблицаРезультат, Выборка)
	
	Пока Выборка.Следующий() Цикл
		СтрокиСДублями = ТаблицаРезультат.НайтиСтроки(Новый Структура("Дубль", Выборка.Дубль));
		Для Каждого СтрокаСДублем Из СтрокиСДублями Цикл
			СтрокаСДублем.Статус = ВыборСтатуса(Выборка.СостояниеУдаленияДубля);
			СтрокаСДублем.КоличествоМестИспользования = Выборка.КоличествоМестИспользования;
			СтрокаСДублем.ДатаПоискаМестИспользования = Выборка.ДатаПоискаМестИспользования;
		КонецЦикла;
		
		ДобавитьСтрокуЕслиОтсутствует(ТаблицаРезультат, Выборка.Дубль, 
			Выборка.ДатаПоискаМестИспользования, Выборка.КоличествоМестИспользования);
		ДобавитьСтрокуЕслиОтсутствует(ТаблицаРезультат, Выборка.Оригинал);
	КонецЦикла;
	
КонецПроцедуры

Процедура ДобавитьСтрокуЕслиОтсутствует(ТаблицаРезультат, Дубль, 
	ДатаИспользования = Неопределено, КоличествоИспользования = Неопределено)
	
	Отбор = Новый Структура("Дубль,Источник", Дубль, Неопределено);
	СтрокиПоиск = ТаблицаРезультат.НайтиСтроки(Отбор);
	Если СтрокиПоиск.Количество() = 0 Тогда
		НоваяСтрока = ТаблицаРезультат.Добавить();
		НоваяСтрока.Дубль = Дубль;
		Если ЗначениеЗаполнено(ДатаИспользования) Тогда
			НоваяСтрока.ДатаПоискаМестИспользования = ДатаИспользования;
		КонецЕсли;
		Если ЗначениеЗаполнено(КоличествоИспользования) Тогда
			НоваяСтрока.КоличествоМестИспользования = КоличествоИспользования;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры


Функция КодНаименование()
	Возврат Новый Структура("Код, Наименование");
КонецФункции

// Формирует строковое представление количества записей и даты для отображения мест использования.
//
// Параметры:
//   Количество - Число - количество найденных записей.
//   Дата - Дата - дата, к которой относится количество записей.
//
// Возвращаемое значение:
//   Строка - текст в формате "%1 на %2", если параметры заполнены, иначе пустая строка.
//
Функция ПредставлениеМестИспользования(Количество, Дата) Экспорт
	
	Результат = "";
	
	Если ЗначениеЗаполнено(Количество) И ЗначениеЗаполнено(Дата) Тогда
		Результат = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = '%1 на %2'"), Количество, Формат(Дата, "ДЛФ=D"));
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ВыборСтатуса(СостояниеУдаленияДубля)
	
	Если СостояниеУдаленияДубля = Перечисления.СостоянияУдаленияДублейНСИ.ЗапланированаЗаменаСсылокИУдаление
		Или СостояниеУдаленияДубля = Перечисления.СостоянияУдаленияДублейНСИ.ЗаменаСсылокИУдалениеПриостановленыИзЗаОшибок Тогда
		Возврат ПоискИЗаменаДублейНСИКлиентСервер.СтатусДубльЗаменить();
		
	ИначеЕсли СостояниеУдаленияДубля = Перечисления.СостоянияУдаленияДублейНСИ.УдалениеНеПланируется Тогда
		Возврат ПоискИЗаменаДублейНСИКлиентСервер.СтатусДубльНеУдалять();
		
	Иначе
		Возврат ПоискИЗаменаДублейНСИКлиентСервер.СтатусТребуетсяПодтверждение();
		
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецЕсли
